src/InformationRegisters/ОборудованиеСетевыеАдаптеры/ОборудованиеСетевыеАдаптеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеСетевыеАдаптеры</name>
  <resources>
    <name>Скорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MACAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подключено</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютераПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СетевойАдаптер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОборудованиеСетевыеАдаптеры/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НайтиОборудование(ИмяКомпьютера, ПлощадкаЭксплуатации) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.ИмяКомпьютера = &ИмяКомпьютера
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    Иначе
        Возврат НайтиОборудованиеПоПолномуИмениКомпьютера(ИмяКомпьютера, ПлощадкаЭксплуатации);
    КонецЕсли;
        
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиОборудованиеПоПолномуИмениКомпьютера(ИмяКомпьютераПолное, ПлощадкаЭксплуатации)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.ИмяКомпьютераПолное = &ИмяКомпьютераПолное
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("ИмяКомпьютераПолное", ИмяКомпьютераПолное);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    Иначе
        Возврат НайтиОборудованиеПоIpАдресу(ИмяКомпьютераПолное, ПлощадкаЭксплуатации)
    КонецЕсли;
        
КонецФункции

Функция НайтиОборудованиеПоIpАдресу(IPAddress, ПлощадкаЭксплуатации)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.IPAddress = &IPAddress
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("IPAddress", IPAddress);
    
    Результат = Запрос.Выполнить();
    
    Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
            
КонецФункции

#КонецОбласти
